## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 23 to add, 0 to change, 23 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                  NAME                                                   |
|----------|---------------------------------------------------------------------------------------------------------|
| recreate | `aws_acm_certificate_validation.notification-canada-ca[0]`                                              |
|          | `aws_acm_certificate_validation.notification-canada-ca-alt[0]`                                          |
|          | `aws_route53_record.api-document-notification-canada-ca-cname`                                          |
|          | `aws_route53_record.api-k8s-scratch-notification-CNAME`                                                 |
|          | `aws_route53_record.api-weighted-0-scratch-notification-A`                                              |
|          | `aws_route53_record.doc-notification-canada-ca-cname`                                                   |
|          | `aws_route53_record.document-notification-canada-ca-cname`                                              |
|          | `aws_route53_record.documentation-notification-canada-ca-cname`                                         |
|          | `aws_route53_record.notificatio-root-WC`                                                                |
|          | `aws_route53_record.notification-alt-root[0]`                                                           |
|          | `aws_route53_record.notification-alt-root-WC[0]`                                                        |
|          | `aws_route53_record.notification-canada-ca[&quot;*.api.staging.notification.cdssandbox.xyz&quot;]`                |
|          | `aws_route53_record.notification-canada-ca[&quot;*.document.staging.notification.cdssandbox.xyz&quot;]`           |
|          | `aws_route53_record.notification-canada-ca[&quot;*.staging.notification.cdssandbox.xyz&quot;]`                    |
|          | `aws_route53_record.notification-canada-ca[&quot;api.staging.notification.cdssandbox.xyz&quot;]`                  |
|          | `aws_route53_record.notification-canada-ca[&quot;staging.notification.cdssandbox.xyz&quot;]`                      |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.staging.alpha.notification.cdssandbox.xyz&quot;]`      |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.staging.alpha.notification.cdssandbox.xyz&quot;]` |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.staging.alpha.notification.cdssandbox.xyz&quot;]`          |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;api.staging.alpha.notification.cdssandbox.xyz&quot;]`        |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;staging.alpha.notification.cdssandbox.xyz&quot;]`            |
|          | `aws_route53_record.notification-root`                                                                  |
|          | `aws_route53_record.notification-www-root`                                                              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate_validation.notification-canada-ca[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "notification-canada-ca" {
      ~ id                      = "2023-02-22 00:24:48.975 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz",
          - "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz",
          - "_b4c1dfe3fa5ef9427b62475bf31154f3.document.staging.notification.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_acm_certificate_validation.notification-canada-ca-alt[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "notification-canada-ca-alt" {
      ~ id                      = "2023-05-16 18:43:16.158 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_62f20d544effcb240b05173b55003507.staging.alpha.notification.cdssandbox.xyz",
          - "_70320bb25a26bdbcb62b272ddda9cf60.api.staging.alpha.notification.cdssandbox.xyz",
          - "_bab9db842fa4f7378eb182a2d90a3d1c.document.staging.alpha.notification.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route53_record.api-document-notification-canada-ca-cname must be replaced
-/+ resource "aws_route53_record" "api-document-notification-canada-ca-cname" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "api.document.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_api.document.staging.notification.cdssandbox.xyz_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "api.document.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.api-k8s-scratch-notification-CNAME must be replaced
-/+ resource "aws_route53_record" "api-k8s-scratch-notification-CNAME" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "api-k8s.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_api-k8s.staging.notification.cdssandbox.xyz_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "api-k8s.staging.notification.cdssandbox.xyz"
      ~ ttl                              = 60 -> 300
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.api-weighted-0-scratch-notification-A must be replaced
-/+ resource "aws_route53_record" "api-weighted-0-scratch-notification-A" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "api.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_api.staging.notification.cdssandbox.xyz_A_loadbalancer" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "api.staging.notification.cdssandbox.xyz"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (2 unchanged attributes hidden)

      ~ alias {
          ~ evaluate_target_health = false -> true
            name                   = "notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com"
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_route53_record.doc-notification-canada-ca-cname must be replaced
-/+ resource "aws_route53_record" "doc-notification-canada-ca-cname" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "doc.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_doc.staging.notification.cdssandbox.xyz_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "doc.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.document-notification-canada-ca-cname must be replaced
-/+ resource "aws_route53_record" "document-notification-canada-ca-cname" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "document.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_document.staging.notification.cdssandbox.xyz_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "document.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.documentation-notification-canada-ca-cname must be replaced
-/+ resource "aws_route53_record" "documentation-notification-canada-ca-cname" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "documentation.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_documentation.staging.notification.cdssandbox.xyz_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "documentation.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.notificatio-root-WC must be replaced
-/+ resource "aws_route53_record" "notificatio-root-WC" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "*.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_*.staging.notification.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "*.staging.notification.cdssandbox.xyz"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.notification-alt-root[0] must be replaced
-/+ resource "aws_route53_record" "notification-alt-root" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "staging.alpha.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_staging.alpha.notification.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "staging.alpha.notification.cdssandbox.xyz"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.notification-alt-root-WC[0] must be replaced
-/+ resource "aws_route53_record" "notification-alt-root-WC" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "*.staging.alpha.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_*.staging.alpha.notification.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "*.staging.alpha.notification.cdssandbox.xyz"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.notification-canada-ca["*.api.staging.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "notification-canada-ca" {
      ~ allow_overwrite                  = true -> false
      ~ fqdn                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz"
      ~ ttl                              = 60 -> 300
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca["*.document.staging.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "notification-canada-ca" {
      ~ allow_overwrite                  = true -> false
      ~ fqdn                             = "_b4c1dfe3fa5ef9427b62475bf31154f3.document.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__b4c1dfe3fa5ef9427b62475bf31154f3.document.staging.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_b4c1dfe3fa5ef9427b62475bf31154f3.document.staging.notification.cdssandbox.xyz"
      ~ ttl                              = 60 -> 300
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca["*.staging.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "notification-canada-ca" {
      ~ allow_overwrite                  = true -> false
      ~ fqdn                             = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz"
      ~ ttl                              = 60 -> 300
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca["api.staging.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "notification-canada-ca" {
      ~ allow_overwrite                  = true -> false
      ~ fqdn                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz"
      ~ ttl                              = 60 -> 300
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca["staging.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "notification-canada-ca" {
      ~ allow_overwrite                  = true -> false
      ~ fqdn                             = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz"
      ~ ttl                              = 60 -> 300
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.staging.alpha.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "notification-canada-ca-alt" {
      ~ fqdn                             = "_70320bb25a26bdbcb62b272ddda9cf60.api.staging.alpha.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__70320bb25a26bdbcb62b272ddda9cf60.api.staging.alpha.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_70320bb25a26bdbcb62b272ddda9cf60.api.staging.alpha.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.staging.alpha.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "notification-canada-ca-alt" {
      ~ fqdn                             = "_bab9db842fa4f7378eb182a2d90a3d1c.document.staging.alpha.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__bab9db842fa4f7378eb182a2d90a3d1c.document.staging.alpha.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_bab9db842fa4f7378eb182a2d90a3d1c.document.staging.alpha.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["*.staging.alpha.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "notification-canada-ca-alt" {
      ~ fqdn                             = "_62f20d544effcb240b05173b55003507.staging.alpha.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__62f20d544effcb240b05173b55003507.staging.alpha.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_62f20d544effcb240b05173b55003507.staging.alpha.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["api.staging.alpha.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "notification-canada-ca-alt" {
      ~ fqdn                             = "_70320bb25a26bdbcb62b272ddda9cf60.api.staging.alpha.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__70320bb25a26bdbcb62b272ddda9cf60.api.staging.alpha.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_70320bb25a26bdbcb62b272ddda9cf60.api.staging.alpha.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["staging.alpha.notification.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "notification-canada-ca-alt" {
      ~ fqdn                             = "_62f20d544effcb240b05173b55003507.staging.alpha.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__62f20d544effcb240b05173b55003507.staging.alpha.notification.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_62f20d544effcb240b05173b55003507.staging.alpha.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.notification-root must be replaced
-/+ resource "aws_route53_record" "notification-root" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_staging.notification.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "staging.notification.cdssandbox.xyz"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.notification-www-root must be replaced
-/+ resource "aws_route53_record" "notification-www-root" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "www.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_www.staging.notification.cdssandbox.xyz_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "www.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 23 to add, 0 to change, 23 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
